# Data Visualization with Modern Data Science

> Assignment 2

Yao-Jen Kuo <yaojenkuo@ntu.edu.tw> from [DATAINPOINT](https://www.datainpoint.com)

## Instructions

- The assignment will be disconnected if idling over 10 minutes, we can reactivate a new session by clicking the assignment link again.
- If you accidentally delete some of the cells, just re-click the assignment link again for a whole new session.
- Write down your solution between comments `-- BEGIN SOLUTION` and `-- END SOLUTION`.
- It is highly recommended that you test your solution in SQLiteStudio then paste into Jupyter Notebook.
- Running tests to see if your solutions are right:
    - File -> Save Notebook to save `exercises.ipynb`.
    - File -> New -> Terminal to open a Terminal.
    - Use command `python test_runner.py` to run test.
- When you are ready to submit, click File -> Export Notebook As -> Executable Script.
- Rename the exported Python script with your student ID(e.g. `b01234567.py`) and upload to the Assignment session on NTU COOL.

## 01. Write a SQL statement that is able to select all the columns and records from `daily_report` as specified.

- Expected inputs：a SQL statement.
- Expected outputs：a (4010, 4) result.

```
              Combined_Key          Last_Update  Confirmed  Deaths
0              Afghanistan  2022-03-01 04:21:09     173659    7598
1                  Albania  2022-03-01 04:21:09     271563    3469
2                  Algeria  2022-03-01 04:21:09     264936    6835
3                  Andorra  2022-03-01 04:21:09      37999     151
4                   Angola  2022-03-01 04:21:09      98741    1900
...                    ...                  ...        ...     ...
4005    West Bank and Gaza  2022-03-01 04:21:09     645947    5501
4006  Winter Olympics 2022  2022-03-01 04:21:09        521       0
4007                 Yemen  2022-03-01 04:21:09      11771    2135
4008                Zambia  2022-03-01 04:21:09     312750    3952
4009              Zimbabwe  2022-03-01 04:21:09     236380    5395

[4010 rows x 4 columns]
```

In [2]:
select_all_from_daily_report =\
"""
-- BEGIN SOLUTION
SELECT *
  FROM daily_report;
-- END SOLUTION
"""

## 02. Write a SQL statement that is able to select four variables from `time_series` as specified.

- Expected inputs：a SQL statement.
- Expected outputs：a (152262, 4) result.

```
              Date        Country_Region  Confirmed  Daily_Cases
0       2020-01-22           Afghanistan          0            0
1       2020-01-22               Albania          0            0
2       2020-01-22               Algeria          0            0
3       2020-01-22               Andorra          0            0
4       2020-01-22                Angola          0            0
...            ...                   ...        ...          ...
152257  2022-02-28    West Bank and Gaza     645947         5733
152258  2022-02-28  Winter Olympics 2022        521            3
152259  2022-02-28                 Yemen      11771            2
152260  2022-02-28                Zambia     312750           43
152261  2022-02-28              Zimbabwe     236380          577

[152262 rows x 4 columns]
```

In [3]:
select_variables_from_time_series =\
"""
-- BEGIN SOLUTION
SELECT Date,
       Country_Region,
       Confirmed,
       Daily_Cases
  FROM time_series;
-- END SOLUTION
"""

## 03. Write a SQL statement that is able to find the records of Taiwan in `time_series`.

- Expected inputs：a SQL statement.
- Expected outputs：a (769, 6) result.

```
           Date Country_Region  Confirmed  Deaths  Daily_Cases  Daily_Deaths
0    2020-01-22         Taiwan          1       0            1             0
1    2020-01-23         Taiwan          1       0            0             0
2    2020-01-24         Taiwan          3       0            2             0
3    2020-01-25         Taiwan          3       0            0             0
4    2020-01-26         Taiwan          4       0            1             0
..          ...            ...        ...     ...          ...           ...
764  2022-02-24         Taiwan      20236     852           80             0
765  2022-02-25         Taiwan      20304     853           68             1
766  2022-02-26         Taiwan      20373     853           69             0
767  2022-02-27         Taiwan      20433     853           60             0
768  2022-02-28         Taiwan      20489     853           56             0

[769 rows x 6 columns]
```

In [4]:
find_taiwan_from_time_series =\
"""
-- BEGIN SOLUTION
SELECT *
  FROM time_series
 WHERE Country_Region = 'Taiwan';
-- END SOLUTION
"""

## 04. Write a SQL statement that is able to find the records of Taiwan and the day of "+0" in `time_series` as specified.

- Expected inputs：a SQL statement.
- Expected outputs：a (173, 3) result.

```
    Country_Region        Date  Daily_Cases
0           Taiwan  2020-01-23            0
1           Taiwan  2020-01-25            0
2           Taiwan  2020-01-29            0
3           Taiwan  2020-02-01            0
4           Taiwan  2020-02-02            0
..             ...         ...          ...
168         Taiwan  2021-03-17            0
169         Taiwan  2021-03-22            0
170         Taiwan  2021-04-07            0
171         Taiwan  2021-04-08            0
172         Taiwan  2021-10-18            0

[173 rows x 3 columns]
```

In [5]:
find_taiwan_plus_zero_from_time_series =\
"""
-- BEGIN SOLUTION
SELECT Country_Region,
       Date,
       Daily_Cases
  FROM time_series
 WHERE Country_Region = 'Taiwan' AND
       Daily_Cases = 0;
-- END SOLUTION
"""

## 05. Write a SQL statement that is able to find the distinct `Last_Update` in `daily_report` as specified.

- Expected inputs：a SQL statement.
- Expected outputs：a (10, 1) result.

```
           Last_Update
0  2022-03-01 04:21:09
1  2020-12-21 13:27:30
2  2021-11-10 23:21:44
3  2022-02-28 23:21:00
4  2021-04-25 23:20:49
5  2020-08-04 02:27:56
6  2020-08-07 22:34:20
7  2021-01-24 23:22:19
8  2021-10-10 23:21:42
9  2021-07-31 23:21:38
```

In [6]:
find_distinct_last_update_from_daily_report =\
"""
-- BEGIN SOLUTION
SELECT DISTINCT Last_Update
  FROM daily_report;
-- END SOLUTION
"""

## 06. Write a SQL statement that is able to find the distinct `Date` in `time_series` as specified.

- Expected inputs：a SQL statement.
- Expected outputs：a (769, 1) result.

```
           Date
0    2020-01-22
1    2020-01-23
2    2020-01-24
3    2020-01-25
4    2020-01-26
..          ...
764  2022-02-24
765  2022-02-25
766  2022-02-26
767  2022-02-27
768  2022-02-28

[769 rows x 1 columns]
```

In [7]:
find_distinct_date_from_time_series =\
"""
-- BEGIN SOLUTION
SELECT DISTINCT Date
  FROM time_series;
-- END SOLUTION
"""

## 07. Write a SQL statement that is able to find the records of US in `daily_report` as specified.

- Expected inputs：a SQL statement.
- Expected outputs：a (3278, 3) result.

```
                 Combined_Key  Confirmed  Deaths
0        Autauga, Alabama, US      15510     194
1        Baldwin, Alabama, US      54978     640
2        Barbour, Alabama, US       5445      93
3           Bibb, Alabama, US       6375      99
4         Blount, Alabama, US      14760     218
...                       ...        ...     ...
3273       Teton, Wyoming, US       9782      16
3274       Uinta, Wyoming, US       5623      36
3275  Unassigned, Wyoming, US          0      18
3276    Washakie, Wyoming, US       2337      43
3277      Weston, Wyoming, US       1548      18

[3278 rows x 3 columns]
```

In [8]:
find_us_from_daily_report =\
"""
-- BEGIN SOLUTION
SELECT Combined_Key,
       Confirmed,
       Deaths
  FROM daily_report
 WHERE Combined_Key LIKE '%, US';
-- END SOLUTION
"""

## 08. Write a SQL statement that is able to find the records of US in `daily_report` and show the top 10 records with the most `Confirmed` as specified.

- Expected inputs：a SQL statement.
- Expected outputs：a (10, 2) result.

```
                  Combined_Key  Confirmed
0  Los Angeles, California, US    2796560
1        Maricopa, Arizona, US    1246178
2      Miami-Dade, Florida, US    1176706
3           Cook, Illinois, US    1111190
4            Harris, Texas, US     992400
5    San Diego, California, US     786060
6          Kings, New York, US     685853
7         Queens, New York, US     634435
8    Riverside, California, US     613527
9         Broward, Florida, US     598603
```

In [9]:
find_us_most_ten_confirmed_from_daily_report =\
"""
-- BEGIN SOLUTION
SELECT Combined_Key,
       Confirmed
  FROM daily_report
 WHERE Combined_Key LIKE '%, US'
 ORDER BY Confirmed DESC
 LIMIT 10;
-- END SOLUTION
"""

## 09. Write a SQL statement that is able to find the records of US in `lookup_table`.

- Expected inputs：a SQL statement.
- Expected outputs：a (3406, 10) result.

```
           UID                   Combined_Key iso2 iso3 Country_Region  \
0           16             American Samoa, US   AS  ASM             US   
1          316                       Guam, US   GU  GUM             US   
2          580   Northern Mariana Islands, US   MP  MNP             US   
3          630                Puerto Rico, US   PR  PRI             US   
4          840                             US   US  USA             US   
...        ...                            ...  ...  ...            ...   
3401  84090053     Unassigned, Washington, US   US  USA             US   
3402  84090054  Unassigned, West Virginia, US   US  USA             US   
3403  84090055      Unassigned, Wisconsin, US   US  USA             US   
3404  84090056        Unassigned, Wyoming, US   US  USA             US   
3405  84099999             Grand Princess, US   US  USA             US   

                Province_State      Admin2      Lat     Long_   Population  
0               American Samoa        None -14.2710 -170.1320      55641.0  
1                         Guam        None  13.4443  144.7937     164229.0  
2     Northern Mariana Islands        None  15.0979  145.6739      55144.0  
3                  Puerto Rico        None  18.2208  -66.5901    3193694.0  
4                         None        None  40.0000 -100.0000  329466283.0  
...                        ...         ...      ...       ...          ...  
3401                Washington  Unassigned      NaN       NaN          NaN  
3402             West Virginia  Unassigned      NaN       NaN          NaN  
3403                 Wisconsin  Unassigned      NaN       NaN          NaN  
3404                   Wyoming  Unassigned      NaN       NaN          NaN  
3405            Grand Princess        None      NaN       NaN          NaN  

[3406 rows x 10 columns]
```

In [10]:
find_us_from_lookup_table =\
"""
-- BEGIN SOLUTION
SELECT *
  FROM lookup_table
 WHERE Country_Region = 'US';
-- END SOLUTION
"""

## 10. Write a SQL statement that is able to find the records of Russia and Ukraine in `lookup_table`.

- Expected inputs：a SQL statement.
- Expected outputs：a (114, 10) result.

```
       UID                 Combined_Key iso2 iso3 Country_Region  \
0      643                       Russia   RU  RUS         Russia   
1      804                      Ukraine   UA  UKR        Ukraine   
2    64301      Adygea Republic, Russia   RU  RUS         Russia   
3    64302           Altai Krai, Russia   RU  RUS         Russia   
4    64303       Altai Republic, Russia   RU  RUS         Russia   
..     ...                          ...  ...  ...            ...   
109  80424        Volyn Oblast, Ukraine   UA  UKR        Ukraine   
110  80425  Zakarpattia Oblast, Ukraine   UA  UKR        Ukraine   
111  80426   Zaporizhia Oblast, Ukraine   UA  UKR        Ukraine   
112  80427     Zhytomyr Oblast, Ukraine   UA  UKR        Ukraine   
113  80428             Unknown, Ukraine   UA  UKR        Ukraine   

         Province_State Admin2        Lat       Long_   Population  
0                  None   None  61.524010  105.318756  145934460.0  
1                  None   None  48.379400   31.165600   43733759.0  
2       Adygea Republic   None  44.693901   40.152042     453376.0  
3            Altai Krai   None  52.693224   82.693142    2350080.0  
4        Altai Republic   None  50.711410   86.857219     218063.0  
..                  ...    ...        ...         ...          ...  
109        Volyn Oblast   None  50.747200   25.325400    1035330.0  
110  Zakarpattia Oblast   None  48.620800   22.287900    1256802.0  
111   Zaporizhia Oblast   None  47.838800   35.139600    1705836.0  
112     Zhytomyr Oblast   None  50.254700   28.658700    1220193.0  
113             Unknown   None        NaN         NaN          NaN  

[114 rows x 10 columns]
```

In [11]:
find_russia_and_ukraine_from_lookup_table =\
"""
-- BEGIN SOLUTION
SELECT *
  FROM lookup_table
 WHERE Country_Region IN ('Russia', 'Ukraine');
-- END SOLUTION
"""

## End of assignment, ignore the following cells.

In [12]:
import pandas as pd

def function_select_all_from_daily_report(con):
    return pd.read_sql(select_all_from_daily_report, con)
def function_select_variables_from_time_series(con):
    return pd.read_sql(select_variables_from_time_series, con)
def function_find_taiwan_from_time_series(con):
    return pd.read_sql(find_taiwan_from_time_series, con)
def function_find_taiwan_plus_zero_from_time_series(con):
    return pd.read_sql(find_taiwan_plus_zero_from_time_series, con)
def function_find_distinct_last_update_from_daily_report(con):
    return pd.read_sql(find_distinct_last_update_from_daily_report, con)
def function_find_distinct_date_from_time_series(con):
    return pd.read_sql(find_distinct_date_from_time_series, con)
def function_find_us_from_daily_report(con):
    return pd.read_sql(find_us_from_daily_report, con)
def function_find_us_most_ten_confirmed_from_daily_report(con):
    return pd.read_sql(find_us_most_ten_confirmed_from_daily_report, con)
def function_find_us_from_lookup_table(con):
    return pd.read_sql(find_us_from_lookup_table, con)
def function_find_russia_and_ukraine_from_lookup_table(con):
    return pd.read_sql(find_russia_and_ukraine_from_lookup_table, con)